       IDENTIFICATION DIVISION.
       PROGRAM-ID. VENDE00.
       AUTHOR. J.GAYAN.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       OBJECT-COMPUTER. IBM-370.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT FVENDED ASSIGN TO FVENDED
           ORGANIZATION IS INDEXED
           ACCESS MODE IS SEQUENTIAL
           RECORD KEY IS CLAVE.
           SELECT SALIDA  ASSIGN TO SALIDA.
       DATA DIVISION.
       FILE SECTION.
       FD  FVENDED
           RECORD 153 CHARACTERS
           DATA RECORD IS REG-FVENDED.
       01 REG-FVENDED.
           02 REG-ENT.
              03 CLAVE PIC X(4).
              03 FILLER PIC X(149).
           02 TODO REDEFINES REG-ENT.
             03 S-COD-VENDEDOR   PIC 9(4).
             03 S-NOMBRE       PIC X(30).
             03 S-FECHA-ALTA.
                 05 S-A-A    PIC X(4).
                 05 S-M-A    PIC XX.
                 05 S-D-A    PIC XX.
             03 S-NIF          PIC X(10).
             03 S-FECHA-NACIMIENTO.
                 05 S-A-N    PIC X(4).
                 05 S-M-N    PIC XX.
                 05 S-D-N    PIC XX.
             03 S-DIRECION     PIC X(30).
             03 S-POBLACION    PIC X(30).
             03 S-COD-POSTAL   PIC X(10).
             03 S-TELEFONO     PIC X(10).
             03 S-ESTADO       PIC X(12).
             03 S-GUAPO        PIC X.
       FD  SALIDA
           BLOCK CONTAINS 0 RECORDS
           LABEL RECORD IS STANDARD
           RECORDING MODE IS F
           RECORD 200 CHARACTERS
           DATA RECORD IS REG-SALIDA1.
       01  REG-SALIDA PIC X(200).
       WORKING-STORAGE SECTION.
       77  FE PIC X.
       01  PASO.
           03 PARAM   PIC X(6).
           03 PARM-RET PIC X.
       01  CABECERA1.
           03 FILLER PIC X(8)   VALUE 'VENDEDOR'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(30)  VALUE '            NOMBRE         '.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(15)   VALUE '  FECHA-ALTA  '.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(6)   VALUE 'NIF  '.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(11)   VALUE ' NACIMIENTO'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(30)       VALUE 'DIRECCION'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(30)   VALUE '             POBLACION'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(6)   VALUE 'CO-POS'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)   VALUE ' TELEFONO'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(11)   VALUE '  ESTADO   '.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(5)   VALUE 'GUAPO'.
       01  CABECERA2.
           03 FILLER PIC X(8)   VALUE ALL '-'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)  VALUE ALL '-'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)   VALUE ALL '-'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(9)   VALUE ALL '-'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(11)  VALUE ALL '-'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(10)  VALUE ALL '-'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(9)  VALUE ALL '-'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(6)  VALUE ALL '-'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(9)  VALUE ALL '-'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(9)  VALUE ALL '-'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(9)  VALUE ALL '-'.
           03 FILLER         PIC X(2) VALUE SPACES.
       01  CABECERA3.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 S-COD-VENDEDOR   PIC ZZZ9.
           03 FILLER         PIC X(5) VALUE SPACES.
           03 S-NOMBRE        PIC X(30).
           03 FILLER         PIC X(1) VALUE SPACES.
           03 S-FECHA-ALTA      PIC X(10).
           03 FILLER         PIC X(2) VALUE SPACES.
           03 S-NIF  PIC X(10).
           03 FILLER         PIC X(2) VALUE SPACES.
           03 S-FECHA-NACIMIENTO     PIC X(10).
           03 FILLER         PIC X(2) VALUE SPACES.
           03 S-DIRECION     PIC X(30).
           03 FILLER         PIC X(2) VALUE SPACES.
           03 S-POBLACION     PIC X(30).
           03 FILLER         PIC X(2) VALUE SPACES.
           03 S-COD-POSTAL     PIC X(10).
           03 FILLER         PIC X(2) VALUE SPACES.
           03 S-TELEFONO     PIC X(10).
           03 FILLER         PIC X(2) VALUE SPACES.
           03 S-ESTADO       PIC X(12).
           03 FILLER         PIC X(2) VALUE SPACES.
           03 S-GUAPO     PIC X(10).
       01 RUTINA PIC X(6) VALUE 'RUTPRO'.
       PROCEDURE DIVISION.
       ABRIR.
           OPEN INPUT FVENDED
           OPEN OUTPUT SALIDA
           WRITE REG-SALIDA FROM CABECERA1 END-WRITE
           WRITE REG-SALIDA FROM CABECERA2 END-WRITE
           READ FVENDED AT END MOVE 1 TO FE END-READ
           PERFORM  UNTIL FE = 1
               MOVE CORR TODO  TO CABECERA3
               WRITE REG-SALIDA FROM CABECERA3 END-WRITE
               READ FVENDED AT END MOVE 1 TO FE END-READ
           END-PERFORM
           CLOSE FVENDED SALIDA
           CALL RUTINA USING PASO
           STOP RUN.
