       IDENTIFICATION DIVISION.
       PROGRAM-ID. GRUPO1.
       AUTHOR. H.GAYAN.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       OBJECT-COMPUTER. IBM-370.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ENTRADA ASSIGN TO ENTRADA
           ORGANIZATION IS INDEXED
           ACCESS MODE IS SEQUENTIAL
           RECORD KEY IS CLAVE.
           SELECT SALIDA ASSIGN TO SALIDA.
       DATA DIVISION.
       FILE SECTION.
       FD  ENTRADA IS EXTERNAL
           RECORD 14 CHARACTERS
           DATA RECORD IS REG-ENTRADA.
       01 REG-ENTRADA.
           02 REG-ENT.
              03 CLAVE PIC X(2).
              03 ERT PIC X(12).
           02 TODO REDEFINES  REG-ENT.
              03 CLAVE1 PIC 9(2).
              03 S-COD-GRUPOS PIC X(12).
       FD  SALIDA
           BLOCK CONTAINS 0 RECORDS
           LABEL RECORD IS STANDARD
           RECORDING MODE IS F
           RECORD 132 CHARACTERS
           DATA RECORD IS REG-SALIDA.
       01  REG-SALIDA PIC X(132).
       WORKING-STORAGE SECTION.
       77  FE PIC X.
       01  CABECERA1.
           03 FILLER PIC X(5)   VALUE 'C-GRU'.
           03 FILLER         PIC XX VALUE SPACES.
           03 FILLER PIC X(5)   VALUE 'GRUPO'.
           03 FILLER         PIC XX VALUE SPACES.
       01  CABECERA2.
           03 FILLER PIC X(5)   VALUE ALL '-'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(12) VALUE ALL '-'.
       01  CABECERA3.
           03 CLAVE2 PIC Z9.
           03 FILLER         PIC X(5) VALUE ALL SPACES.
           03 S-COD2 PIC X(12).
       LINKAGE SECTION.
       PROCEDURE DIVISION.
       ABRIR.
           OPEN INPUT ENTRADA
           OPEN OUTPUT SALIDA
           WRITE REG-SALIDA FROM CABECERA1 END-WRITE
           WRITE REG-SALIDA FROM CABECERA2 END-WRITE
           READ ENTRADA AT END MOVE 1 TO FE END-READ
           PERFORM  UNTIL FE = 1
             MOVE CLAVE1 TO CLAVE2
             MOVE S-COD-GRUPOS TO S-COD2
               WRITE REG-SALIDA FROM CABECERA3 END-WRITE
               READ ENTRADA AT END MOVE 1 TO FE END-READ
           END-PERFORM
           CLOSE ENTRADA SALIDA
           STOP RUN.
