       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRODUCT.
       AUTHOR. J.GAYAN.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       OBJECT-COMPUTER. IBM-370.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT FPRODUC ASSIGN TO FPRODUC
           ORGANIZATION IS INDEXED
           ACCESS MODE IS SEQUENTIAL
           RECORD KEY IS FPRODUC-CLAVE.
           SELECT SALIDA  ASSIGN TO SALIDA.
       DATA DIVISION.
       FILE SECTION.
       FD  FPRODUC
           RECORD 30 CHARACTERS
           DATA RECORD IS REG-FPRODUC.
       01 REG-FPRODUC.
           02 REG-FPRODUC1.
              03 FPRODUC-CLAVE PIC X(4).
              03 FILLER PIC X(26).
           02 TODO REDEFINES REG-FPRODUC1.
             03 S-IDPRODUCTO   PIC 9(4).
             03 S-NOMPRODUCTO  PIC X(20).
             03 S-IDGRUPO      PIC 99.
             03 S-PRECIO       PIC 9(2)99.
       FD  SALIDA
           BLOCK CONTAINS 0 RECORDS
           LABEL RECORD IS STANDARD
           RECORDING MODE IS F
           RECORD 132 CHARACTERS
           DATA RECORD IS REG-SALIDA.
       01  REG-SALIDA PIC X(132).
       WORKING-STORAGE SECTION.
       77  FE PIC X.
       01  CABECERA1.
           03 FILLER PIC X(5)   VALUE 'C-PRO'.
           03 FILLER         PIC X VALUE SPACES.
           03 FILLER PIC X(20)  VALUE '    NOMPRODUCTO  '.
           03 FILLER         PIC X VALUE SPACES.
           03 FILLER PIC X(5)   VALUE 'C-GRU'.
           03 FILLER         PIC X VALUE SPACES.
           03 FILLER PIC X(10)   VALUE '  PRECIO  '.
       01  CABECERA2.
           03 FILLER PIC X(5)   VALUE ALL '-'.
           03 FILLER         PIC X VALUE SPACES.
           03 FILLER PIC X(20) VALUE ALL '-'.
           03 FILLER         PIC X VALUE SPACES.
           03 FILLER PIC X(5)   VALUE ALL '-'.
           03 FILLER         PIC X VALUE SPACES.
           03 FILLER PIC X(8)   VALUE ALL '-'.
       01  CABECERA3.
           03 S-IDPRODUCTO   PIC ZZZ9.
           03 FILLER         PIC X(3) VALUE SPACES.
           03 S-NOMPRODUCTO  PIC X(20).
           03 FILLER         PIC X(3) VALUE SPACES.
           03 S-IDGRUPO      PIC Z9.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 S-PRECIO       PIC ZZ.99.
       PROCEDURE DIVISION.
       ABRIR.
           OPEN INPUT FPRODUC
           OPEN OUTPUT SALIDA
           WRITE REG-SALIDA FROM CABECERA1 END-WRITE
           WRITE REG-SALIDA FROM CABECERA2 END-WRITE
           READ FPRODUC AT END MOVE 1 TO FE END-READ
           PERFORM  UNTIL FE = 1
               MOVE CORR TODO TO CABECERA3
               WRITE REG-SALIDA FROM CABECERA3 END-WRITE
               READ FPRODUC AT END MOVE 1 TO FE END-READ
           END-PERFORM
           CLOSE FPRODUC SALIDA
           STOP RUN.
