       IDENTIFICATION DIVISION.
       PROGRAM-ID. VENTAS3.
       AUTHOR. J.GAYAN.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       OBJECT-COMPUTER. IBM-370.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ENTRADA ASSIGN TO ENTRADA.
           SELECT SALIDA  ASSIGN TO SALIDA.
           SELECT FPRODUC ASSIGN TO FPRODUC
           ORGANIZATION IS INDEXED
           ACCESS MODE IS RANDOM
           RECORD KEY IS FPRODUC-CLAVE.
           SELECT FVENDED ASSIGN TO FVENDED
           ORGANIZATION IS INDEXED
           ACCESS MODE IS RANDOM
           RECORD KEY IS FVENDED-CLAVE.
       DATA DIVISION.
       FILE SECTION.
       FD  ENTRADA
           BLOCK CONTAINS 0 RECORDS
           LABEL RECORD IS STANDARD
           RECORDING MODE IS F
           RECORD 28 CHARACTERS
           DATA RECORD IS REG-ENTRADA.
       01 REG-ENTRADA.
           02 REG-ENT.
              03 CLAVE PIC X(6).
              03 FILLER PIC X(22).
           02 TODO REDEFINES REG-ENT.
             03 S-COD-VENTA PIC 9(6).
             03 S-COD-VENDEDOR   PIC 9(4).
             03 S-COD-PRODUCTO  PIC 9(4).
             03 S-A    PIC 9(4).
             03 S-M    PIC 99.
             03 S-D    PIC 99.
             03 S-KILOS       PIC 9(4)V99.
       FD  SALIDA
           BLOCK CONTAINS 0 RECORDS
           LABEL RECORD IS STANDARD
           RECORDING MODE IS F
           RECORD 144 CHARACTERS
           DATA RECORD IS REG-SALIDA.
       01  REG-SALIDA PIC X(144).
       FD  FVENDED
           RECORD 153 CHARACTERS
           DATA RECORD IS REG-FVENDED.
       01 REG-FVENDED.
           02 REG-ENT.
              03 FVENDED-CLAVE PIC X(4).
              03 FILLER PIC X(149).
           02 TODO REDEFINES REG-ENT.
             03 FVENDED-COD-VENDEDOR PIC 9(4).
             03 FVENDED-NOMBRE PIC X(30).
             03 FVENDED-FECHA-ALTA.
                 05 FVENDED-A-A PIC X(4).
                 05 FVENDED-M-A PIC XX.
                 05 FVENDED-D-A PIC XX.
             03 FVENDED-NIF    PIC X(10).
             03 FVENDED-FECHA-NACIMIENTO.
                 05 FVENDED-A-N PIC X(4).
                 05 FVENDED-M-N PIC XX.
                 05 FVENDED-D-N PIC XX.
             03 FVENDED-DIRECION PIC X(30).
             03 FVENDED-POBLACION PIC X(30).
             03 FVENDED-COD-POSTAL PIC X(10).
             03 FVENDED-TELEFONO PIC X(10).
             03 FVENDED-ESTADO PIC X(12).
             03 FVENDED-GUAPO  PIC X.
       FD  FPRODUC
           RECORD 30 CHARACTERS
           DATA RECORD IS REG-FPRODUC.
       01 REG-FPRODUC.
             02 NADA.
               03 FPRODUC-CLAVE PIC X(4).
               03 FILLER PIC X(26).
             02 TODO REDEFINES NADA.
                03 S-IDPRODUCTO   PIC 9(4).
                03 S-NOMPRODUCTO  PIC X(20).
                03 S-IDGRUPO      PIC 99.
                03 S-PRECIO       PIC 9(2)V99.
       WORKING-STORAGE SECTION.
       77  FE PIC X.
       77  A  PIC 99.
       77  W-COD-VENDEDOR  PIC 9(4).
       77  W-COD-PRODUCTO  PIC 9(4).
       77  WANYO           PIC 9(4).
       01  FILLER.
           02 WKILOS PIC 9(6)V99 OCCURS 12.
       01  CABECERA1.
           03 FILLER PIC X(11)   VALUE 'VENDEDOR   '.
           03 CAB-COD-VENDEDOR   PIC ZZZ9.
           03 FILLER         PIC XX VALUE SPACES.
           03 CAB-NOM-VENDEDOR   PIC X(30).
       01  CABECERA2.
           03 FILLER PIC X(4)   VALUE ALL 'COD.'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(20)   VALUE ALL '   PRODUCTO  '.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(8)  VALUE ALL 'ENERO'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(8)  VALUE ALL 'FEBRERO'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(8)  VALUE ALL 'MARZO  '.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(8)  VALUE ALL 'ABRIL  '.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(8)  VALUE ALL 'MAYO   '.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(8)  VALUE ALL 'JUNIO  '.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(8)  VALUE ALL 'JULIO  '.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(8)  VALUE ALL 'AGOSTO '.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(8)  VALUE ALL 'SEPTIEM'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(8)  VALUE ALL 'OCTUBRE'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(8)  VALUE ALL 'NOVIEMB'.
           03 FILLER         PIC X(2) VALUE SPACES.
           03 FILLER PIC X(8)  VALUE ALL 'DICIEMB'.
       01  CABECERA3.
           03 CAB-COD-PRODUCTO   PIC ZZZ9.
           03 FILLER         PIC X(3) VALUE SPACES.
           03 CAB-NOM-PRODUCTO   PIC X(20).
           03 CAB-KILOS      PIC ZZZZ9,99 OCCURS 12.
       PROCEDURE DIVISION.
       ABRIR.
           ACCEPT WANYO
           OPEN INPUT ENTRADA FVENDED FPRODUC
           OPEN OUTPUT SALIDA
           MOVE 0 TO FE
           READ ENTRADA AT END MOVE 1 TO FE END-READ
           PERFORM  UNTIL FE = 1
            MOVE S-COD-VENDEDOR TO W-COD-VENDEDOR
            PERFORM IMPRIMIR-CABECERA
             PERFORM  UNTIL S-COD-VENDEDOR NOT = W-COD-VENDEDOR OR
                       FE = 1
               MOVE S-COD-PRODUCTO TO W-COD-PRODUCTO
               PERFORM RESET-WKILOS
               PERFORM  UNTIL S-COD-PRODUCTO NOT = W-COD-PRODUCTO OR
                       FE = 1
                 IF S-A = WANYO
                    ADD  S-KILOS TO WKILOS(S-M)
                 END-IF
                 READ ENTRADA AT END MOVE 1 TO FE END-READ
              END-PERFORM
             PERFORM IMPRIMIR-DETALLE
             END-PERFORM
           END-PERFORM
           CLOSE ENTRADA SALIDA FVENDED FPRODUC
           STOP RUN.
       IMPRIMIR-CABECERA.
           MOVE W-COD-VENDEDOR TO FVENDED-CLAVE
           READ FVENDED  KEY IS FVENDED-CLAVE
              INVALID KEY  DISPLAY FVENDED-CLAVE  '    ERROR FVENDED'
           END-READ
           MOVE FVENDED-COD-VENDEDOR TO CAB-COD-VENDEDOR
           MOVE FVENDED-NOMBRE       TO CAB-NOM-VENDEDOR
           WRITE REG-SALIDA FROM CABECERA1 END-WRITE
           WRITE REG-SALIDA FROM CABECERA2 END-WRITE.
       IMPRIMIR-DETALLE.
           MOVE W-COD-PRODUCTO TO FPRODUC-CLAVE
           READ FPRODUC  KEY IS FPRODUC-CLAVE
             INVALID KEY    DISPLAY  FPRODUC-CLAVE '    ERROR FPRODUC'
           END-READ
           MOVE S-NOMPRODUCTO  TO CAB-NOM-PRODUCTO
           MOVE W-COD-PRODUCTO TO  CAB-COD-PRODUCTO
           PERFORM  VARYING A FROM 1 BY 1 UNTIL A > 12
               MOVE  WKILOS(A)  TO CAB-KILOS(A)
           END-PERFORM
           WRITE REG-SALIDA FROM CABECERA3 END-WRITE.
       RESET-WKILOS.
           PERFORM  VARYING A FROM 1 BY 1 UNTIL A > 12
             MOVE 0 TO WKILOS(A)
           END-PERFORM.

