       IDENTIFICATION DIVISION.
       PROGRAM-ID. INFOVER.
       AUTHOR. H.GAYAN.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       OBJECT-COMPUTER. IBM-370.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       COPY CDEFFVER.
       WORKING-STORAGE SECTION.
       01 TABLA-VEND-PROD-MES.
          02 TAB-VENDEDOR PIC 9(4) OCCURS 15.
          02 TAB-MES PIC 9(2) OCCURS 12.
          02 TAB-PRODUCTO OCCURS 15
             INDEXED BY TAB-INDICE-CODPROD.
             03 DES-PRODUCTO PIC X(20).
             03 TAB-KILOS PIC 9(4)V99.
       01 TABLAS-VENTAS.
           02 TAB-VENTAS OCCURS 500 TIMES
           INDEXED BY TAB-INDICE-VENTAS.
               03 TAB-COD-VEND   PIC 9(4).
               03 TAB-COD-PROD  PIC 9(4).
               03 TAB-M    PIC 99.
               03 TAB-VKILOS  PIC 9(4)V99.
       77  FE PIC X.
       77  WCUENTA PIC 9(4).
       PROCEDURE DIVISION.
       ABRIR.
           INITIALIZE TABLA-VEND-PROD-MES REPLACING NUMERIC DATA BY 0
           INITIALIZE TABLAS-VENTAS REPLACING NUMERIC DATA BY 0
           OPEN INPUT ENTRADAV ENTRADAP ENTRADAG ENTRADAX
           OPEN OUTPUT SALIDA
      *///////////////LECTURA FICHERO MODVENTA
           SET TAB-INDICE-VENTAS TO 1
           READ ENTRADAV AT END MOVE 1 TO FE END-READ
            PERFORM  UNTIL FE = 1
             PERFORM  UNTIL TAB-INDICE-VENTAS = 500
              MOVE S-COD-VENDEDOR TO TAB-COD-VEND(TAB-INDICE-VENTAS)
              MOVE S-COD-PRODUCTO TO TAB-COD-PROD(TAB-INDICE-VENTAS)
              MOVE S-M TO TAB-M(TAB-INDICE-VENTAS)
              MOVE S-KILOS TO TAB-VKILOS(TAB-INDICE-VENTAS)
              READ ENTRADAV AT END MOVE 1 TO FE END-READ
              SET TAB-INDICE-VENTAS UP BY 1
             END-PERFORM
           END-PERFORM.
      *//////////////FIN LECTURA MODVENTA
      *//////////////LLENAR TABLA VEND-PROD-MES
           SET TAB-INDICE-VENTAS TO 1
           SET TAB-INDICE-CODPROD TO 1
           PERFORM UNTIL TAB-INDICE-CODPROD = 15
           SET TAB-INDICE-VENTAS TO 1
           PERFORM UNTIL TAB-VENDEDOR(TAB-INDICE-VENTAS) NOT =
            TAB-COD-VEND(TAB-INDICE-CODPROD)
             IF TAB-M(TAB-INDICE-VENTAS) =
                TAB-COD-PROD(TAB-INDICE-VENTAS)
               MOVE TAB-VKILOS(TAB-INDICE-VENTAS) TO
               TAB-KILOS(TAB-INDICE-CODPROD)
               END-IF
                SET TAB-INDICE-VENTAS UP BY 1
                END-PERFORM
                 SET TAB-INDICE-CODPROD UP BY 1
                 END-PERFORM
      *    WRITE REG-SALIDA FROM CABECERA1 END-WRITE
      *    WRITE REG-SALIDA FROM CABECERA2 END-WRITE
           CLOSE SALIDA ENTRADAV ENTRADAP ENTRADAG ENTRADAX
           STOP RUN.
