       IDENTIFICATION DIVISION.
       PROGRAM-ID. HISVE2.
       AUTHOR. J.GAYAN.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       OBJECT-COMPUTER. IBM-370.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ENTRADA ASSIGN TO ENTRADA.
           SELECT SALIDA  ASSIGN TO SALIDA
           ORGANIZATION IS INDEXED
           ACCESS MODE IS SEQUENTIAL
           RECORD KEY IS SCLAVE
           ALTERNATE RECORD KEY IS AIX-ANYO WITH DUPLICATES
           ALTERNATE RECORD KEY IS AIX-COD-VENDEDOR WITH DUPLICATES
           ALTERNATE RECORD KEY IS AIX-COD-PRODUCTO WITH DUPLICATES.
       DATA DIVISION.
       FILE SECTION.
       FD  ENTRADA
           BLOCK CONTAINS 0 RECORDS
           LABEL RECORD IS STANDARD
           RECORDING MODE IS F
           RECORD 28 CHARACTERS
           DATA RECORD IS REG-ENTRADA.
       01 REG-ENTRADA.
           02 REG-ENT.
              03 CLAVE PIC X(6).
              03 FILLER PIC X(22).
           02 TODO REDEFINES REG-ENT.
             03 S-COD-VENTA PIC 9(6).
             03 S-COD-VENDEDOR   PIC 9(4).
             03 S-COD-PRODUCTO  PIC 9(4).
             03 S-A    PIC 9(4).
             03 S-M    PIC 99.
             03 S-D    PIC 99.
             03 S-KILOS       PIC 9(4)V99.
       FD  SALIDA
           RECORD 150 CHARACTERS
           DATA RECORD IS REG-SALIDA.
       01  REG-SALIDA.
           02 REG-SAL.
              03 SCLAVE            PIC X(6).
              03 AIX-ANYO          PIC X(4).
              03 AIX-COD-VENDEDOR  PIC X(4).
              03 AIX-COD-PRODUCTO  PIC X(4).
              03 FILLER            PIC X(132).
           02 STODO REDEFINES REG-SAL.
              03 FHVE-CLAVE          PIC 9(6).
              03 FHVE-ANYO           PIC X(4).
              03 FHVE-COD-VENDEDOR   PIC 9(4).
              03 FHVE-COD-PRODUCTO   PIC 9(4).
              03 FHVE-KILOS          PIC 9(9)V99 OCCURS 12.
       WORKING-STORAGE SECTION.
       77  FE PIC 9  VALUE 0.
       77  A  PIC 99.
       77  W-CONTADOR      PIC 9(6) VALUE 0.
       77  W-COD-VENDEDOR  PIC 9(4).
       77  W-COD-PRODUCTO  PIC 9(4).
       77  W-A             PIC 9(4).
       PROCEDURE DIVISION.
       ABRIR.
           OPEN INPUT ENTRADA
           OPEN EXTEND SALIDA
           PERFORM RESET-KILOS.
           READ ENTRADA AT END MOVE 1 TO FE END-READ
           PERFORM  UNTIL FE = 1
             MOVE S-A  TO W-A
             PERFORM  UNTIL S-A NOT = W-A OR FE = 1
               MOVE S-COD-VENDEDOR TO W-COD-VENDEDOR
               PERFORM  UNTIL S-COD-VENDEDOR NOT = W-COD-VENDEDOR OR
                       FE = 1
                 MOVE S-COD-PRODUCTO TO W-COD-PRODUCTO
                 PERFORM  UNTIL S-COD-PRODUCTO NOT = W-COD-PRODUCTO OR
                       FE = 1
                    ADD  S-KILOS TO FHVE-KILOS(S-M)
                    READ ENTRADA AT END MOVE 1 TO FE END-READ
                    DISPLAY ' CLAVE   ' CLAVE
                 END-PERFORM
                 MOVE W-COD-PRODUCTO TO FHVE-COD-PRODUCTO
                 MOVE W-COD-VENDEDOR TO FHVE-COD-VENDEDOR
                 MOVE W-A TO FHVE-ANYO
                 PERFORM IMPRIMIR-DETALLE
               END-PERFORM
             END-PERFORM
           END-PERFORM
           CLOSE ENTRADA SALIDA
           STOP RUN.
       RESET-KILOS.
           PERFORM  VARYING A FROM 1 BY 1 UNTIL A > 12
             MOVE 0 TO FHVE-KILOS(A)
           END-PERFORM.
       IMPRIMIR-DETALLE.
           ADD  1 TO W-CONTADOR
           MOVE W-CONTADOR TO FHVE-CLAVE
           WRITE REG-SALIDA INVALID KEY DISPLAY W-CONTADOR 'ERROR'
                END-WRITE
           PERFORM RESET-KILOS.
